block('page')(
  content()(node => {
    return [
      {
        block: 'header',
        //mods: {inverse: node.ctx.foo === 'bar'},
        logo: 'logo_md.png',
        logoDescription: 'Водные экскурсии по рекам и каналам Петербурга, прогулки по Неве на теплоходе NevaTrip',
        slogan: 'Лучшие водные экскурсии по Петербургу',
        langs: ['ru', 'en', 'zh']
      },
      {
        block: 'navigation',
        navigation: [
          {
            title: 'Дневные&nbsp;экскурсии',
            subtitle: 'по рекам и каналам Петербурга',
            url: '/day'
          },
          {
            title: 'Ночные прогулки',
            subtitle: 'под развод мостов',
            url: '/night'
          },
          {
            title: 'Метеор',
            subtitle: 'в Петергоф и пригороды',
            url: '/meteors'
          },
          {
            title: 'Аренда теплохода',
            subtitle: 'на свадьбу, корпоратив',
            url: '/arenda-teplokhoda'
          }
        ]
      },
      apply('mods'),
      {
        block: 'page',
        elem: 'spreader'
      },
      {
        block: 'footer',
        awards: [
          'Лучшая компания 2014 года всероссийской программы «Ты — предприниматель» в Санкт-Петербурге',
          '1 место «Молодой предприниматель России 2015» в номинации «Сфера услуг»'
        ],
        mainNavHeading: 'А&nbsp;здесь ещё больше подборок с&nbsp;прогулками и&nbsp;экскурсиями:',
        mainNav: [
          {
            name: 'Причалы Санкт-Петербурга',
            url: '/prichaly-sankt-peterburga'
          },
          {
            name: 'Активные водные прогулки',
            url: '/active'
          },
          {
            name: 'Корпоратив на теплоходе',
            url: '/korporativ-na-teplohode'
          },
          {
            name: 'Экскурсии по Неве с гидом',
            url: '/ekskursii-po-neve'
          },
          {
            name: 'Прогулки по рекам и каналам',
            url: '/progulki-po-rekam-i-kanalam-peterburga'
          },
          {
            name: 'Выпускной на теплоходе',
            url: '/vipusknoy-na-teplokhode'
          },
          {
            name: 'Экскурсии на развод мостов с гидом',
            url: '/ekskursii-na-razvod-mostov'
          },
          {
            name: 'Прогулки по Неве на теплоходе',
            url: '/progulki-po-neve-na-teplohode'
          },
          {
            name: 'День рождения на теплоходе',
            url: '/den-rojdeniya-na-teplokhode'
          },
          {
            name: 'Недорогие экскурсии: цены 2019',
            url: '/ekskursii-po-peterburgu-tsena'
          },
          {
            name: 'Экскурсии по пригородам Петербурга',
            url: '/ehkskursii-po-prigorodam-peterburga'
          },
          {
            name: 'Банкет на теплоходе',
            url: '/banket-na-teplohode'
          },
          {
            name: 'Романтический вечер на теплоходе',
            url: '/romanticheskij-vecher-dlya-dvoih-spb'
          },
          {
            name: 'Музыкальные и джазовые теплоходы',
            url: '/muzykalnij-teplohod'
          },
          {
            name: 'Свадьба на теплоходе',
            url: '/svadba-na-teplokhode'
          },
          {
            name: 'Ресторан на теплоходе',
            url: '/restoran-na-teplohode'
          },
          {
            name: 'Прогулки на речном трамвайчике',
            url: '/rechnoj-tramvajchik-peterburga'
          },
          {
            name: 'Групповые экскурсии по Петербургу',
            url: '/gruppovye-ehkskursii-po-peterburgu'
          },
          {
            name: 'Экскурсии для детей',
            url: '/ekskursii-dlya-detey-spb'
          },
        ],
        basicNav: [
          {
            name: 'О&nbsp;нас',
            url: '/about'
          },
          {
            name: 'Оферта',
            url: '/oferta'
          },
          {
            name: 'Сотрудничество',
            url: '/sotrudnichestvo'
          },
          {
            name: 'Наш Блог',
            url: '/blog'
          },
          {
            name: 'Личный кабинет',
            url: '/partner'
          },
          {
            name: 'Прогулки в&nbsp;Москве',
            url: 'https://moskvatrip.ru/'
          },
        ],
        copyright: '&copy;&nbsp;2014&ndash;2018 Санкт-Петербург, ул&nbsp;Малая Морская&nbsp;11&nbsp;&nbsp;<svg style="position: relative; top:3px" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 372.48 372.48" width="15" height="15"><path d="M357.48 71.246H15c-8.271 0-15 6.729-15 15v199.988c0 8.271 6.728 15 15 15h342.48c8.271 0 15-6.729 15-15V86.246c0-8.271-6.728-15-15-15zM86.293 186.24c0-23.568 14.379-43.842 34.824-52.509l-34.718 55.855a57.923 57.923 0 0 1-.106-3.346zm2.874 17.836l46.162-74.268a57.171 57.171 0 0 1 7.964-.568c5.59 0 11.068.811 16.301 2.369l-59.086 92.232a56.973 56.973 0 0 1-11.341-19.765zm18.72 26.784l61.16-95.469a56.971 56.971 0 0 1 9.984 6.473c-10.889 12.254-16.844 27.809-16.844 44.376 0 1.22.037 2.434.102 3.643l-34.881 51.088a56.853 56.853 0 0 1-19.521-10.111zm35.406 12.38c-1.74 0-3.459-.091-5.16-.245l26.49-38.798c2.689 9.732 7.572 18.726 14.408 26.419-10.111 8.168-22.621 12.624-35.738 12.624zm85.895 0c-14.785 0-28.808-5.651-39.482-15.912-11.297-10.858-17.518-25.45-17.518-41.088s6.221-30.23 17.518-41.088c10.675-10.261 24.697-15.912 39.482-15.912 31.43 0 57 25.57 57 57s-25.571 57-57 57z" fill="#FFF"/></svg> <svg  style="position: relative; top:3px" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 56.48 56.48" width="15" height="15"><path d="M55.026 9.939H1.454C.65 9.939 0 10.59 0 11.393v33.695c0 .803.65 1.454 1.454 1.454h53.572c.804 0 1.454-.651 1.454-1.454V11.393c0-.803-.65-1.454-1.454-1.454zM4.373 21h6.028c.813.031 1.468.29 1.694 1.159l1.311 6.305c-1.288-3.298-4.392-6.042-9.083-7.178l.05-.286zm7.294 14.38L8.185 23.484c2.503 1.602 4.635 4.144 5.386 5.913l.406 1.469 3.808-9.729h4.12l-6.123 14.24-4.115.003zm13.266.01h-3.888l2.431-14.268h3.89L24.933 35.39zm6.766.214c-1.743-.018-3.422-.363-4.332-.762l.547-3.193.501.227c1.277.533 2.104.749 3.661.749 1.117 0 2.314-.437 2.325-1.393.007-.625-.501-1.071-2.015-1.771-1.476-.682-3.43-1.826-3.406-3.875.021-2.773 2.729-4.708 6.572-4.708 1.506 0 2.713.31 3.483.599l-.525 3.093-.351-.165a7.174 7.174 0 0 0-2.91-.546c-1.522 0-2.228.634-2.228 1.227-.008.668.824 1.108 2.184 1.77 2.243 1.018 3.28 2.253 3.266 3.876-.03 2.96-2.683 4.872-6.772 4.872zm16.85-.208s-.355-1.64-.473-2.138l-4.98-.006c-.151.385-.817 2.144-.817 2.144h-4.083l5.773-13.075c.41-.929 1.105-1.184 2.037-1.184h3.004l3.147 14.258-3.608.001z" fill="#FFF"/><path d="M46.542 26.215l-.262-1.23c-.198.537-.539 1.4-.517 1.362 0 0-1.229 3.167-1.549 3.988h3.229l-.901-4.12z" fill="#FFF"/></svg>'
      },
    ]
  }),
  addMods()(node => ({route: node.data.view || node.data.page}))
);

